ext_alsav/AccumulationRegisters/СвободныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СвободныеОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеСоСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ГрафикОтгрузкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрафикОтгрузкиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоНеобеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоИзЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_СоставИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_СоставИзделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУзле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьВСборкеНоменклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолуфабрикат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ГрафикПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрафикПоступленияТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоИзЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/Enums/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаетсяАвансДоОбеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаетсяПредоплатаДоОтгрузки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Enums/ВариантыОплатыКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОплатыКлиентом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КредитПослеОтгрузки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/CommonModules/алсав_НоменклатураОстатки/Ext/Module.bsl
Функция _ПолучитьДоступныйОстаток(массивНоменклатуры, склад) ЭКСПОРТ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Набор.Номенклатура КАК Номенклатура,
	               |	Набор.Характеристика КАК Характеристика,
	               |	СУММА(Набор.ВНаличии) КАК ВНаличииОстаток,
	               |	СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика) + СУММА(Набор.КОбеспечению) + СУММА(Набор.КОбеспечениюИзСборок) КАК ВРезерве,
	               |	СУММА(Набор.КОтгрузке) КАК КОтгрузке,
	               |	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика) + СУММА(Набор.КОбеспечению) + СУММА(Набор.КОбеспечениюИзСборок)) КАК ДоступныйОстаток
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Таблица.Номенклатура КАК Номенклатура,
	               |		Таблица.Характеристика КАК Характеристика,
	               |		Таблица.Склад КАК Склад,
	               |		Таблица.ВНаличии КАК ВНаличии,
	               |		0 КАК ПриходОсновной,
	               |		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
	               |		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
	               |		0 КАК ВРезервеГрафика,
	               |		Таблица.КОтгрузке КАК КОтгрузке,
	               |		Таблица.КОбеспечению КАК КОбеспечению,
	               |		Таблица.КОбеспечениюИзСборок КАК КОбеспечениюИзСборок
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			Набор.Номенклатура КАК Номенклатура,
	               |			Набор.Характеристика КАК Характеристика,
	               |			Набор.Склад КАК Склад,
	               |			СУММА(Набор.ВНаличии) КАК ВНаличии,
	               |			СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	               |			СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
	               |			СУММА(Набор.КОтгрузке) КАК КОтгрузке,
	               |			СУММА(Набор.КОбеспечению) КАК КОбеспечению,
	               |			СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				Таблица.Номенклатура КАК Номенклатура,
	               |				Таблица.Характеристика КАК Характеристика,
	               |				Таблица.Склад КАК Склад,
	               |				Таблица.ВНаличииОстаток КАК ВНаличии,
	               |				Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
	               |				Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
	               |				0 КАК КОтгрузке,
	               |				0 КАК КОбеспечению,
	               |				0 КАК КОбеспечениюИзСборок
	               |			ИЗ
	               |				РегистрНакопления.СвободныеОстатки.Остатки(, ) КАК Таблица
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				Таблица.Номенклатура,
	               |				Таблица.Характеристика,
	               |				Таблица.Склад,
	               |				Таблица.КОтгрузкеОстаток,
	               |				0,
	               |				0,
	               |				Таблица.КОтгрузкеОстаток,
	               |				0,
	               |				0
	               |			ИЗ
	               |				РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК Таблица
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				Таблица.Номенклатура,
	               |				Таблица.Характеристика,
	               |				Таблица.Склад,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				СУММА(Таблица.КоличествоНеобеспечено),
	               |				0
	               |			ИЗ
	               |				РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				Таблица.Номенклатура,
	               |				Таблица.Характеристика,
	               |				Таблица.Склад
	               |			
	               |			ИМЕЮЩИЕ
	               |				СУММА(Таблица.КоличествоНеобеспечено) > 0
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
	               |				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
	               |				Таблица.Склад,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				СУММА(ВТ_ВариантыКомплектацииНоменклатуры.Количество * Таблица.КоличествоНеобеспечено)
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					Таблица.Номенклатура КАК Номенклатура,
	               |					Таблица.Характеристика КАК Характеристика,
	               |					Таблица.Склад КАК Склад,
	               |					СУММА(Таблица.КоличествоНеобеспечено) КАК КоличествоНеобеспечено
	               |				ИЗ
	               |					РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					Таблица.Номенклатура,
	               |					Таблица.Характеристика,
	               |					Таблица.Склад
	               |				
	               |				ИМЕЮЩИЕ
	               |					СУММА(Таблица.КоличествоНеобеспечено) > 0) КАК Таблица
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	               |						ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
	               |						ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
	               |						ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
	               |						ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
	               |						ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
	               |						ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	               |					ИЗ
	               |						Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
	               |							ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
	               |							ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
	               |								И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
	               |								И (Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ)
	               |								И (Полуфабрикаты.Ссылка.Основной)
	               |					ГДЕ
	               |						ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |						И ВариантыКомплектацииНоменклатуры.Ссылка.Основной) КАК ВТ_ВариантыКомплектацииНоменклатуры
	               |					ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Таблица.Номенклатура)
	               |						И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика ЕСТЬ NULL
	               |							ИЛИ ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Таблица.Характеристика)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
	               |				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
	               |				Таблица.Склад) КАК Набор
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Набор.Номенклатура,
	               |			Набор.Характеристика,
	               |			Набор.Склад) КАК Таблица) КАК Набор
	               |ГДЕ
	               |	Набор.Номенклатура В(&Номенклатура)
	               |	И Набор.Склад = &Склад
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Набор.Номенклатура,
	               |	Набор.Характеристика
	               |
	               |";//|ИМЕЮЩИЕ
	               //|	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика)) - СУММА(Набор.КОбеспечению) - СУММА(Набор.КОбеспечениюИзСборок) > 0";
	
	Запрос.УстановитьПараметр("Номенклатура", массивНоменклатуры);
	Запрос.УстановитьПараметр("Склад", склад);
	
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Функция ПолучитьДоступныйОстаток(массивНоменклатуры, склад) ЭКСПОРТ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Номенклатура КАК Номенклатура,
	               |	Т.Характеристика КАК Характеристика,
	               |	СУММА(Т.ВНаличииОстаток) КАК ВНаличииОстаток,
	               |	СУММА(Т.ВРезерве) КАК ВРезерве,
	               |	СУММА(Т.КОтгрузке) КАК КОтгрузке,
	               //|	ЕСТЬNULL(СУММА(Т.ВНаличииОстаток), 0) - ЕСТЬNULL(СУММА(Т.ВРезерве), 0) - ЕСТЬNULL(СУММА(Т.КОтгрузке), 0) КАК ДоступныйОстаток
				   |	ЕСТЬNULL(СУММА(Т.ВНаличииОстаток), 0) - ЕСТЬNULL(СУММА(Т.ВРезерве), 0) КАК ДоступныйОстаток
				   //|	ЕСТЬNULL(СУММА(Т.ВНаличииОстаток), 0) КАК ДоступныйОстаток
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		остатки.Номенклатура КАК Номенклатура,
	               |		остатки.Характеристика КАК Характеристика,
	               |		остатки.ВНаличииОстаток КАК ВНаличииОстаток,
	               |		ЕСТЬNULL(остатки.ВРезервеСоСкладаОстаток, 0) + ЕСТЬNULL(остатки.ВРезервеПодЗаказОстаток, 0) КАК ВРезерве,
	               |		0 КАК КОтгрузке
	               |	ИЗ
	               |		РегистрНакопления.СвободныеОстатки.Остатки(
	               |				,
	               |				Номенклатура В (&Номенклатура)
	               |					И Склад = &Склад) КАК остатки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТоварыКОтгрузке.Номенклатура,
	               |		ТоварыКОтгрузке.Характеристика,
	               |		0,
	               //|		ЕСТЬNULL(ТоварыКОтгрузке.ВРезервеОстаток, 0),
				   |		0,
	               |		ЕСТЬNULL(ТоварыКОтгрузке.КОтгрузкеОстаток, 0)
	               |	ИЗ
	               |		РегистрНакопления.ТоварыКОтгрузке.Остатки(
	               |				,
	               |				Номенклатура В (&Номенклатура)
	               |					И Склад = &Склад) КАК ТоварыКОтгрузке) КАК Т
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Т.Характеристика,
	               |	Т.Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", массивНоменклатуры);
	Запрос.УстановитьПараметр("Склад", склад);
	
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Функция ПолучитьПотребность(номенклатура, характеристика, количество) ЭКСПОРТ
	вариантКомплектации = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(номенклатура, характеристика);
	Если ЗначениеЗаполнено(вариантКомплектации) Тогда
		результ = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьКомплектующиеНоменклатуры(вариантКомплектации, , количество);
		результ.Колонки.Добавить("ПервичнаяПотребность");
		результ.ЗаполнитьЗначения(Ложь, "ПервичнаяПотребность");
		
	Иначе
		результ = новый ТаблицаЗначений;
		результ.Колонки.Добавить("Номенклатура");
		результ.Колонки.Добавить("Характеристика");
		результ.Колонки.Добавить("Количество");
		результ.Колонки.Добавить("ПервичнаяПотребность");
		
		нСтр = результ.Добавить();
		нСтр.Номенклатура = Номенклатура;
		нСтр.Характеристика = Характеристика;
		нСтр.Количество = Количество;
		нСтр.ПервичнаяПотребность = Истина;
	КонецЕсли;	
	
	Возврат результ;
КонецФункции

Функция РасчетДоступностиСложныхТоваровИУпаковокДоступноСейчасСкладАдресногоХранения(номенклатура, характеристика) ЭКСПОРТ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТОсновнаяВыборка.Доступно КАК Доступно,
	               |	ТОсновнаяВыборка.ПродуктНоменклатура КАК ПродуктНоменклатура,
	               |	ТОсновнаяВыборка.ПродуктХарактеристика КАК ПродуктХарактеристика,
	               |	ТОсновнаяВыборка.Номенклатура КАК Номенклатура,
	               |	ТОсновнаяВыборка.Характеристика КАК Характеристика,
	               |	ТОсновнаяВыборка.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ТОсновнаяВыборка.Склад КАК Склад,
	               |	ВЫБОР
	               |		КОГДА ТОсновнаяВыборка.Доступно - ТОсновнаяВыборка.ВЗаказеОплаченоНеОбеспечено < ТОсновнаяВыборка.КоличествоУпаковок
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫРАЗИТЬ((ТОсновнаяВыборка.Доступно - ТОсновнаяВыборка.ВЗаказеОплаченоНеОбеспечено) / ТОсновнаяВыборка.КоличествоУпаковок - 0.5 КАК ЧИСЛО(10, 0))
	               |	КОНЕЦ КАК ВозможностьСобрать,
	               |	ТОсновнаяВыборка.КОтгрузке КАК КОтгрузке,
	               |	ТОсновнаяВыборка.НеОбеспечено КАК НеОбеспечено,
	               |	ТОсновнаяВыборка.ВЗаказеВсе КАК ВЗаказеВсе,
	               |	ТОсновнаяВыборка.ВЗаказе КАК ВЗаказе,
	               |	ТОсновнаяВыборка.ВРезерве КАК ВРезерве,
	               |	ТОсновнаяВыборка.ВЗаказеОплачено КАК ВЗаказеОплачено,
	               |	ТОсновнаяВыборка.ВЗаказеНЕОплачено КАК ВЗаказеНЕОплачено
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЕСТЬNULL(ОстаткиИРезерв.ВНаличииОстаток, 0) - ЕСТЬNULL(ОстаткиИРезерв.ВРезервеСоСкладаОстаток, 0) - ЕСТЬNULL(ОстаткиИРезерв.ВРезервеПодЗаказОстаток, 0) КАК Доступно,
	               |		ТСпецификация.ПродуктНоменклатура КАК ПродуктНоменклатура,
	               |		ТСпецификация.ПродуктХарактеристика КАК ПродуктХарактеристика,
	               |		ТСпецификация.Номенклатура КАК Номенклатура,
	               |		ТСпецификация.Характеристика КАК Характеристика,
	               |		ТСпецификация.КоличествоУпаковок КАК КоличествоУпаковок,
	               |		ТСпецификация.Склад КАК Склад,
	               |		ЕСТЬNULL(ОстаткиИРезерв.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
	               |		ЕСТЬNULL(Заказы.КОтгрузке, 0) КАК КОтгрузке,
	               |		ЕСТЬNULL(Заказы.НеОбеспечено, 0) КАК НеОбеспечено,
	               |		ЕСТЬNULL(Заказы.ВЗаказеВсе, 0) КАК ВЗаказеВсе,
	               |		ЕСТЬNULL(Заказы.ВЗаказе, 0) КАК ВЗаказе,
	               |		ЕСТЬNULL(Заказы.ВРезерве, 0) КАК ВРезерве,
	               |		ЕСТЬNULL(Заказы.ВЗаказеОплачено, 0) КАК ВЗаказеОплачено,
	               |		ЕСТЬNULL(Заказы.ВЗаказеОплаченоНеОбеспечено, 0) КАК ВЗаказеОплаченоНеОбеспечено,
	               |		ЕСТЬNULL(Заказы.ВЗаказеНЕОплачено, 0) КАК ВЗаказеНЕОплачено
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			Т.ПродуктНоменклатура КАК ПродуктНоменклатура,
	               |			Т.ПродуктХарактеристика КАК ПродуктХарактеристика,
	               |			Т.Номенклатура КАК Номенклатура,
	               |			Т.Характеристика КАК Характеристика,
	               |			Склад.Ссылка КАК Склад,
	               |			СУММА(Т.КоличествоУпаковок) КАК КоличествоУпаковок
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				алсав_СоставИзделий.ПродуктНоменклатура КАК ПродуктНоменклатура,
	               |				алсав_СоставИзделий.ПродуктХарактеристика КАК ПродуктХарактеристика,
	               |				алсав_СоставИзделий.Номенклатура КАК Номенклатура,
	               |				алсав_СоставИзделий.Характеристика КАК Характеристика,
	               |				алсав_СоставИзделий.Количество КАК КоличествоУпаковок
	               |			ИЗ
	               |				РегистрСведений.алсав_СоставИзделий КАК алсав_СоставИзделий
	               |			ГДЕ
	               |				алсав_СоставИзделий.ЭтоМатериалы = ЛОЖЬ
	               |				И алсав_СоставИзделий.ЭтоПолуфабрикат = ЛОЖЬ
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				Номенклатура.Ссылка,
	               |				ХарактеристикиНоменклатуры.Ссылка,
	               |				Номенклатура.Ссылка,
	               |				ХарактеристикиНоменклатуры.Ссылка,
	               |				1
	               |			ИЗ
	               |				Справочник.Номенклатура КАК Номенклатура
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |					ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка)
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Активен
	               |					ПО (ДР_Активен.Ссылка = Номенклатура.Ссылка)
	               |						И (ДР_Активен.Свойство.Заголовок = ""Активность на сайте"")
	               |						И (ДР_Активен.Значение.Наименование = ""Да"")
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_ТипСкладскогоУчета
	               |					ПО (ДР_ТипСкладскогоУчета.Ссылка = Номенклатура.Ссылка)
	               |						И (ДР_ТипСкладскогоУчета.Свойство.Заголовок = ""Тип складского учета"")
	               |						И (ДР_ТипСкладскогоУчета.Значение.Наименование = ""Одна упаковка"")) КАК Т
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склад
	               |				ПО (Склад.Наименование = ""Склад адресного хранения"")
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Т.ПродуктНоменклатура,
	               |			Т.ПродуктХарактеристика,
	               |			Т.Номенклатура,
	               |			Т.Характеристика,
	               |			Склад.Ссылка) КАК ТСпецификация
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВТ_Заказы.Номенклатура КАК Номенклатура,
	               |				ВТ_Заказы.Характеристика КАК Характеристика,
	               |				ВТ_Заказы.Склад КАК Склад,
	               |				СУММА(ВТ_Заказы.КОтгрузке) КАК КОтгрузке,
	               |				СУММА(ВТ_Заказы.НеОбеспечено) КАК НеОбеспечено,
	               |				СУММА(ВТ_Заказы.ВРезерве) + СУММА(ВТ_Заказы.КОтгрузке) + СУММА(ВТ_Заказы.НеОбеспечено) КАК ВЗаказеВсе,
	               |				СУММА(ВТ_Заказы.НеОбеспечено) КАК ВЗаказе,
	               |				СУММА(ЕСТЬNULL(ВТ_Заказы.ВРезерве, 0) + ЕСТЬNULL(ВТ_Заказы.КОтгрузке, 0)) КАК ВРезерве,
	               |				СУММА(ВЫБОР
	               |						КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	               |								ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	               |							ТОГДА ЕСТЬNULL(ВТ_Заказы.ВРезерве, 0) + ЕСТЬNULL(ВТ_Заказы.КОтгрузке, 0) + ЕСТЬNULL(ВТ_Заказы.НеОбеспечено, 0)
	               |						ИНАЧЕ 0
	               |					КОНЕЦ) КАК ВЗаказеОплачено,
	               |				СУММА(ВЫБОР
	               |						КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	               |								ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	               |							ТОГДА ЕСТЬNULL(ВТ_Заказы.НеОбеспечено, 0)
	               |						ИНАЧЕ 0
	               |					КОНЕЦ) КАК ВЗаказеОплаченоНеОбеспечено,
	               |				СУММА(ВЫБОР
	               |						КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	               |								ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	               |							ТОГДА 0
	               |						ИНАЧЕ ЕСТЬNULL(ВТ_Заказы.ВРезерве, 0) + ЕСТЬNULL(ВТ_Заказы.КОтгрузке, 0) + ЕСТЬNULL(ВТ_Заказы.НеОбеспечено, 0)
	               |					КОНЕЦ) КАК ВЗаказеНЕОплачено
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура, ВТ_Заказы.Номенклатура) КАК Номенклатура,
	               |					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Характеристика, ВТ_Заказы.Характеристика) КАК Характеристика,
	               |					ВТ_Заказы.Склад КАК Склад,
	               |					ВТ_Заказы.Заказ КАК Заказ,
	               |					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.ВРезерве КАК ВРезерве,
	               |					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.КОтгрузке КАК КОтгрузке,
	               |					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.НеОбеспечено КАК НеОбеспечено
	               |				ИЗ
	               |					(ВЫБРАТЬ
	               |						ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	               |						ТоварыКОтгрузке.Характеристика КАК Характеристика,
	               |						ТоварыКОтгрузке.Склад КАК Склад,
	               |						ТоварыКОтгрузке.ДокументОтгрузки КАК Заказ,
	               |						ТоварыКОтгрузке.ВРезервеОстаток КАК ВРезерве,
	               |						ТоварыКОтгрузке.КОтгрузкеОстаток КАК КОтгрузке,
	               |						0 КАК НеОбеспечено
	               |					ИЗ
	               |						РегистрНакопления.ТоварыКОтгрузке.Остатки(, НЕ ДокументОтгрузки ССЫЛКА Документ.ЗаказНаСборку) КАК ТоварыКОтгрузке
	               |					
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |					
	               |					ВЫБРАТЬ
	               |						ГрафикОтгрузкиТоваров.Номенклатура,
	               |						ГрафикОтгрузкиТоваров.Характеристика,
	               |						ГрафикОтгрузкиТоваров.Склад,
	               |						ГрафикОтгрузкиТоваров.Регистратор,
	               |						0,
	               |						0,
	               |						ГрафикОтгрузкиТоваров.КоличествоНеобеспечено
	               |					ИЗ
	               |						РегистрНакопления.ГрафикОтгрузкиТоваров КАК ГрафикОтгрузкиТоваров) КАК ВТ_Заказы
	               |						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |							состав.ВариантКомплектацииНоменклатуры КАК Ссылка,
	               |							состав.ПродуктНоменклатура КАК НоменклатураОсновногоКомпонента,
	               |							состав.ПродуктХарактеристика КАК ХарактеристикаОсновногоКомпонента,
	               |							состав.ПутьВСборке КАК НоменклатураПутьСборки,
	               |							состав.Номенклатура КАК Номенклатура,
	               |							состав.Характеристика КАК Характеристика,
	               |							состав.Количество КАК Количество,
	               |							состав.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	               |						ИЗ
	               |							РегистрСведений.алсав_СоставИзделий КАК состав
	               |						ГДЕ
	               |							состав.ЭтоПолуфабрикат = ЛОЖЬ
	               |							И состав.ЭтоМатериалы = ЛОЖЬ) КАК ВТ_ВариантыКомплектацииНоменклатуры
	               |						ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = ВТ_Заказы.Номенклатура)
	               |							И (ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = ВТ_Заказы.Характеристика)) КАК ВТ_Заказы
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						СостоянияЗаказов.Заказ КАК ЗаказКлиента,
	               |						ВЫБОР
	               |							КОГДА СостоянияЗаказов.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяАвансДоОбеспечения), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяПредоплатаДоОтгрузки))
	               |								ТОГДА ЛОЖЬ
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ КАК ОплаченПоУсловиюСоглашения,
	               |						ВЫБОР
	               |							КОГДА ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) >= &ПроцентОплаты
	               |								ТОГДА ИСТИНА
	               |							ИНАЧЕ ЛОЖЬ
	               |						КОНЕЦ КАК ЕстьОплата,
	               |						СостоянияЗаказов.ПроцентОплаты КАК ПроцентОплаты
	               |					ИЗ
	               |						РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказов) КАК СостоянияЗаказов
	               |					ПО (СостоянияЗаказов.ЗаказКлиента = ВТ_Заказы.Заказ)
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	               |						СУММА(ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа) КАК ПроцентКредита
	               |					ИЗ
	               |						Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
	               |					ГДЕ
	               |						ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка.Проведен = ИСТИНА
	               |						И ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
	               |					
	               |					СГРУППИРОВАТЬ ПО
	               |						ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка) КАК ГрафикОплаты
	               |					ПО (ГрафикОплаты.Ссылка = ВТ_Заказы.Заказ)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВТ_Заказы.Номенклатура,
	               |				ВТ_Заказы.Характеристика,
	               |				ВТ_Заказы.Склад) КАК Заказы
	               |			ПО (ТСпецификация.Номенклатура = ТСпецификация.Номенклатура)
	               |				И (ТСпецификация.Характеристика ЕСТЬ NULL
	               |					ИЛИ ТСпецификация.Характеристика = Заказы.Характеристика)
	               |				И ТСпецификация.Склад = Заказы.Склад
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |				РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	               |				РеализацияТоваровУслугТовары.Ссылка.Склад КАК Склад,
	               |				СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	               |			ИЗ
	               |				Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |			ГДЕ
	               |				РеализацияТоваровУслугТовары.Ссылка.Дата > НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -120), ДЕНЬ)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РеализацияТоваровУслугТовары.Номенклатура,
	               |				РеализацияТоваровУслугТовары.Характеристика,
	               |				РеализацияТоваровУслугТовары.Ссылка.Склад) КАК Продажи
	               |			ПО ТСпецификация.Номенклатура = Продажи.Номенклатура
	               |				И (ТСпецификация.Характеристика ЕСТЬ NULL
	               |					ИЛИ ТСпецификация.Характеристика = Продажи.Характеристика)
	               |				И ТСпецификация.Склад = Продажи.Склад
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	               |			ПО ТСпецификация.Номенклатура = ТоварныеОграничения.Номенклатура
	               |				И (ТСпецификация.Характеристика ЕСТЬ NULL
	               |					ИЛИ ТСпецификация.Характеристика = ТоварныеОграничения.Характеристика)
	               |				И ТСпецификация.Склад = ТоварныеОграничения.Склад
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикПоступленияТоваров.Остатки(, ) КАК ГрафикПоступления
	               |			ПО ТСпецификация.Номенклатура = ГрафикПоступления.Номенклатура
	               |				И (ТСпецификация.Характеристика ЕСТЬ NULL
	               |					ИЛИ ТСпецификация.Характеристика = ГрафикПоступления.Характеристика)
	               |				И ТСпецификация.Склад = ГрафикПоступления.Склад
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(, ) КАК ОстаткиИРезерв
	               |			ПО ТСпецификация.Номенклатура = ОстаткиИРезерв.Номенклатура
	               |				И (ТСпецификация.Характеристика ЕСТЬ NULL
	               |					ИЛИ ТСпецификация.Характеристика = ОстаткиИРезерв.Характеристика)
	               |				И ТСпецификация.Склад = ОстаткиИРезерв.Склад
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, НЕ ДокументОтгрузки ССЫЛКА Документ.ЗаказНаСборку) КАК Т_КОтгрузке
	               |			ПО ТСпецификация.Номенклатура = Т_КОтгрузке.Номенклатура
	               |				И (ТСпецификация.Характеристика ЕСТЬ NULL
	               |					ИЛИ ТСпецификация.Характеристика = Т_КОтгрузке.Характеристика)
	               |				И ТСпецификация.Склад = Т_КОтгрузке.Склад) КАК ТОсновнаяВыборка
	               |ГДЕ
	               |	ТОсновнаяВыборка.Номенклатура = &Номенклатура
	               |	И ТОсновнаяВыборка.Характеристика = &Характеристика
	               |	И ТОсновнаяВыборка.Склад.Наименование = ""Склад адресного хранения""";  
	
	Запрос.УстановитьПараметр("Номенклатура",номенклатура);
	Запрос.УстановитьПараметр("Характеристика",характеристика);
	Запрос.УстановитьПараметр("ПроцентОплаты",0.01);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	
	рез = Запрос.Выполнить().Выгрузить();
	резалт = 999;
	Для Каждого стр из рез Цикл
		Если рез.ВозможностьСобрать >= 0 и рез.ВозможностьСобрать < резалт Тогда
			резалт = рез.ВозможностьСобрать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(резалт = 999, 0, резалт);
КонецФункции
	
Функция ПолучитьДоступноСейчасСкладАдресногоХранения(номенклатура, характеристика) ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                      |	Т.ВНаличии - Т.ВРезерве - Т.КОбеспечению - Т.КОбеспечениюИзСборок КАК ДоступноСейчас,
	                      |	Т.Номенклатура КАК Номенклатура,
	                      |	Т.Характеристика КАК Характеристика,
	                      |	Т.Склад КАК Склад
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Набор.Номенклатура КАК Номенклатура,
	                      |		Набор.Характеристика КАК Характеристика,
	                      |		Набор.Склад КАК Склад,
	                      |		СУММА(Набор.ВНаличии) КАК ВНаличии,
	                      |		СУММА(Набор.ПриходОсновной) КАК ПриходОсновной,
	                      |		СУММА(Набор.РасходОсновной) КАК РасходОсновной,
	                      |		СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) КАК ВРезервеСоСкладаИПодЗаказ,
	                      |		СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика) КАК ВРезерве,
	                      |		СУММА(Набор.КОтгрузке) КАК Котгрузке,
	                      |		СУММА(Набор.КОбеспечению) КАК КОбеспечению,
	                      |		СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			Таблица.Номенклатура КАК Номенклатура,
	                      |			Таблица.Характеристика КАК Характеристика,
	                      |			Таблица.Склад КАК Склад,
	                      |			Таблица.ВНаличии КАК ВНаличии,
	                      |			0 КАК ПриходОсновной,
	                      |			Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
	                      |			Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
	                      |			0 КАК ВРезервеГрафика,
	                      |			Таблица.КОтгрузке КАК КОтгрузке,
	                      |			Таблица.КОбеспечению КАК КОбеспечению,
	                      |			Таблица.КОбеспечениюИзСборок КАК КОбеспечениюИзСборок
	                      |		ИЗ
	                      |			(ВЫБРАТЬ
	                      |				Набор.Номенклатура КАК Номенклатура,
	                      |				Набор.Характеристика КАК Характеристика,
	                      |				Набор.Склад КАК Склад,
	                      |				СУММА(Набор.ВНаличии) КАК ВНаличии,
	                      |				СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	                      |				СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
	                      |				СУММА(Набор.КОтгрузке) КАК КОтгрузке,
	                      |				СУММА(Набор.КОбеспечению) КАК КОбеспечению,
	                      |				СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
	                      |			ИЗ
	                      |				(ВЫБРАТЬ
	                      |					Таблица.Номенклатура КАК Номенклатура,
	                      |					Таблица.Характеристика КАК Характеристика,
	                      |					Таблица.Склад КАК Склад,
	                      |					Таблица.ВНаличииОстаток КАК ВНаличии,
	                      |					Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
	                      |					Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
	                      |					0 КАК КОтгрузке,
	                      |					0 КАК КОбеспечению,
	                      |					0 КАК КОбеспечениюИзСборок
	                      |				ИЗ
	                      |					РегистрНакопления.СвободныеОстатки.Остатки(, ) КАК Таблица
	                      |				
	                      |				ОБЪЕДИНИТЬ ВСЕ
	                      |				
	                      |				ВЫБРАТЬ
	                      |					Таблица.Номенклатура,
	                      |					Таблица.Характеристика,
	                      |					Таблица.Склад,
	                      |					Таблица.КОтгрузкеОстаток,
	                      |					0,
	                      |					0,
	                      |					Таблица.КОтгрузкеОстаток,
	                      |					0,
	                      |					0
	                      |				ИЗ
	                      |					РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК Таблица
	                      |				
	                      |				ОБЪЕДИНИТЬ ВСЕ
	                      |				
	                      |				ВЫБРАТЬ
	                      |					Таблица.Номенклатура,
	                      |					Таблица.Характеристика,
	                      |					Таблица.Склад,
	                      |					0,
	                      |					0,
	                      |					0,
	                      |					0,
	                      |					СУММА(Таблица.КоличествоНеобеспечено),
	                      |					0
	                      |				ИЗ
	                      |					РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	                      |				
	                      |				СГРУППИРОВАТЬ ПО
	                      |					Таблица.Номенклатура,
	                      |					Таблица.Характеристика,
	                      |					Таблица.Склад
	                      |				
	                      |				ИМЕЮЩИЕ
	                      |					СУММА(Таблица.КоличествоНеобеспечено) > 0
	                      |				
	                      |				ОБЪЕДИНИТЬ ВСЕ
	                      |				
	                      |				ВЫБРАТЬ
	                      |					ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
	                      |					ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
	                      |					Таблица.Склад,
	                      |					0,
	                      |					0,
	                      |					0,
	                      |					0,
	                      |					0,
	                      |					СУММА(ВТ_ВариантыКомплектацииНоменклатуры.Количество * Таблица.КоличествоНеобеспечено)
	                      |				ИЗ
	                      |					(ВЫБРАТЬ
	                      |						Таблица.Номенклатура КАК ГрафикОтгрузкиТоваровНоменклатура,
	                      |						Таблица.Характеристика КАК ГрафикОтгрузкиТоваровХарактеристика,
	                      |						Таблица.Склад КАК Склад,
	                      |						СУММА(Таблица.КоличествоНеобеспечено) КАК КоличествоНеобеспечено
	                      |					ИЗ
	                      |						РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	                      |					
	                      |					СГРУППИРОВАТЬ ПО
	                      |						Таблица.Номенклатура,
	                      |						Таблица.Характеристика,
	                      |						Таблица.Склад
	                      |					
	                      |					ИМЕЮЩИЕ
	                      |						СУММА(Таблица.КоличествоНеобеспечено) > 0) КАК Таблица
	                      |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |							ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	                      |							ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
	                      |							ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
	                      |							ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
	                      |							ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
	                      |							ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
	                      |							ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	                      |						ИЗ
	                      |							Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
	                      |								ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
	                      |								ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
	                      |									И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
	                      |									И (Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ)
	                      |									И (Полуфабрикаты.Ссылка.Основной)
	                      |						ГДЕ
	                      |							ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |							И ВариантыКомплектацииНоменклатуры.Ссылка.Основной) КАК ВТ_ВариантыКомплектацииНоменклатуры
	                      |						ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Таблица.ГрафикОтгрузкиТоваровНоменклатура)
	                      |							И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика ЕСТЬ NULL
	                      |								ИЛИ ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Таблица.ГрафикОтгрузкиТоваровХарактеристика)
	                      |				
	                      |				СГРУППИРОВАТЬ ПО
	                      |					ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
	                      |					ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
	                      |					Таблица.Склад) КАК Набор
	                      |			
	                      |			СГРУППИРОВАТЬ ПО
	                      |				Набор.Номенклатура,
	                      |				Набор.Характеристика,
	                      |				Набор.Склад) КАК Таблица) КАК Набор
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		Набор.Номенклатура,
	                      |		Набор.Характеристика,
	                      |		Набор.Склад) КАК Т
	                      |ГДЕ
	                      |	Т.Номенклатура = &Номенклатура
	                      |	И Т.Характеристика = &Характеристика
	                      |	И Т.Склад.Наименование = ""Склад адресного хранения""";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);	
	рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Если Рез.ДоступноСейчас > 0 Тогда
			Возврат Рез.ДоступноСейчас;
		КонецЕсли;
	КонецЕсли;
	Возврат 0;
КонецФункции
